-- データ投入
-- ユーザ
INSERT INTO sample.user values
  ('0000000001', 'サンプル 太郎', 500),
  ('0000000002', 'サンプル 次郎', 0)
;

-- 支払
INSERT INTO sample.payment values
  ('0000000001', '2021/01/01 10:10:00', 200, 6000, true, '0000000001'),
  ('0000000002', '2021/01/02 11:10:00', 300, 4000, false, '0000000001')
;

-- ポイント利用履歴
INSERT INTO sample.point_history values
  ('0000000001', '0000000001', 200, '2021/01/01 10:10:00'),
  ('0000000001', '0000000002', 300, '2021/01/02 11:10:00')
;

-- 支払明細
INSERT INTO sample.payment_detail values
  ('0000000001', '〇〇シャンプー', 3200),
  ('0000000001', '〇〇本', 3000),
  ('0000000002', '〇〇食器', 4300)
;

-- 支払方法明細
INSERT INTO sample.payment_method_detail values
  ('0000000001', '現金', 2000),
  ('0000000001', 'クレジットカード', 2000),
  ('0000000001', '電子マネー', 2000),
  ('0000000002', 'クレジットカード', 4000)
;
